In [46]:
from functools import reduce
import numpy as np
import pandas as pd

In [2]:
def half(x):
    return x / 2

In [14]:
l = [10, 12, 34, 23]
map(half, l)

In [18]:
list(map(half, l))

[5.0, 6.0, 17.0, 11.5]

In [28]:
reduce(lambda x,y: y if x>y else x, l)

10

In [30]:
list(filter(lambda x: x % 2 == 1, l))

[23]

In [47]:
colnames = ['Column1','Column2','Column3','Column4','Column5']

In [48]:
df = pd.DataFrame(np.random.random((10,5)), columns=colnames)

In [49]:
df

    Column1   Column2   Column3   Column4   Column5
0  0.914242  0.647870  0.472620  0.582537  0.698674
1  0.566399  0.832791  0.333272  0.779494  0.456960
2  0.806736  0.106489  0.480014  0.385261  0.982973
3  0.615590  0.338433  0.792640  0.453397  0.746420
4  0.384572  0.063122  0.490084  0.448928  0.740284
5  0.640532  0.984637  0.922887  0.565447  0.448902
6  0.341541  0.169841  0.647174  0.868223  0.104391
7  0.769671  0.062278  0.964483  0.169254  0.810482
8  0.054201  0.270789  0.625496  0.274712  0.366148
9  0.911468  0.574275  0.212037  0.754346  0.618995

In [52]:
type(df[["Column1","Column2","Column3"]])

pandas.core.frame.DataFrame

In [72]:
dico_3 = {"Eterle":[23], "REROR":[43], "ZORIR":[19]}

In [94]:
df_3 = pd.DataFrame(dico_3)
df_4 = pd.DataFrame(dico_3).transpose()

In [97]:
#df_3.columns = ["Age"]
df_3

   Eterle  REROR  ZORIR
0      23     43     19

In [118]:
df_3 = pd.DataFrame.from_dict(dico_3, orient='index')
df_3

         0
Eterle  23
REROR   43
ZORIR   19

In [122]:
df_3.columns = ["Age"]
df_3

        Age
Eterle   23
REROR    43
ZORIR    19

In [106]:
df_4

        Age
Eterle   23
REROR    43
ZORIR    19

In [110]:
df_4["Age"].mean()

28.333333333333332

In [111]:
df = pd.DataFrame(np.random.randn(4, 3), columns=['a', 'b', 'c'])

In [112]:
df

          a         b         c
0 -0.166367  0.013969 -1.735718
1  0.121907  0.699236  0.529836
2 -0.044599 -0.304005 -1.024060
3 -0.356406 -2.081764 -0.340021

In [116]:
df.apply(sum)

a   -0.445465
b   -1.672564
c   -2.569963
dtype: float64